In [370]:
import pandas as pd

In [371]:
football = pd.read_csv('england.csv')
football.head()

,Date,Season,home,visitor,FT,hgoal,vgoal,division,tier,totgoal,goaldif,result
0,1888-09-08,1888,Bolton Wanderers,Derby County,3-6,3,6,1,1,9,-3,A
1,1888-09-08,1888,Everton,Accrington F.C.,2-1,2,1,1,1,3,1,H
2,1888-09-08,1888,Preston North End,Burnley,5-2,5,2,1,1,7,3,H
3,1888-09-08,1888,Stoke City,West Bromwich Albion,0-2,0,2,1,1,2,-2,A
4,1888-09-08,1888,Wolverhampton Wanderers,Aston Villa,1-1,1,1,1,1,2,0,D

In [372]:
football.tail()

,Date,Season,home,visitor,FT,hgoal,vgoal,division,tier,totgoal,goaldif,result
199879,2020-03-07,2019,Plymouth Argyle,Macclesfield,3-0,3,0,4,4,3,3,H
199880,2020-03-07,2019,Salford City,Bradford City,2-0,2,0,4,4,2,2,H
199881,2020-03-07,2019,Swindon Town,Forest Green Rovers,0-2,0,2,4,4,2,-2,A
199882,2020-03-07,2019,Walsall,Exeter City,3-1,3,1,4,4,4,2,H
199883,2020-03-10,2019,Carlisle United,Newport County,2-0,2,0,4,4,2,2,H

## Paso 1
- Filtrando únicamente por división 1 y tier 1
- Borrando columna tier 1
- Borrando columna FT

In [373]:
football = football[(football.division == 1) & (football.Season >= 1980)]
football.head()

,Date,Season,home,visitor,FT,hgoal,vgoal,division,tier,totgoal,goaldif,result
131077,1986-09-02,1986,Arsenal,Sheffield Wednesday,2-0,2,0,1,1,2,2,H
131078,1986-09-02,1986,Charlton Athletic,Wimbledon,0-1,0,1,1,1,1,-1,A
131079,1986-09-02,1986,Chelsea,Coventry City,0-0,0,0,1,1,0,0,D
131080,1986-09-02,1986,Everton,Oxford United,3-1,3,1,1,1,4,2,H
131081,1986-09-02,1986,Southampton,Tottenham Hotspur,2-0,2,0,1,1,2,2,H

In [374]:
football = football.drop('tier', axis=1)
football = football.drop('FT', axis=1)

In [375]:
football.head()

,Date,Season,home,visitor,hgoal,vgoal,division,totgoal,goaldif,result
131077,1986-09-02,1986,Arsenal,Sheffield Wednesday,2,0,1,2,2,H
131078,1986-09-02,1986,Charlton Athletic,Wimbledon,0,1,1,1,-1,A
131079,1986-09-02,1986,Chelsea,Coventry City,0,0,1,0,0,D
131080,1986-09-02,1986,Everton,Oxford United,3,1,1,4,2,H
131081,1986-09-02,1986,Southampton,Tottenham Hotspur,2,0,1,2,2,H

## Paso 2
- Quitando el año de la columna Date
- Separando mes y día en dos columnas como int64

In [376]:
temp = football.Date.str.split('-',  n=-1, expand=True)
temp = temp.drop(0, axis=1)

In [377]:
temp.columns = ['month', 'day']

In [378]:
temp.month = temp.month.astype(int)
temp.day = temp.month.astype(int)

In [379]:
temp.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 13338 entries, 131077 to 198491
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   month   13338 non-null  int64
 1   day     13338 non-null  int64
dtypes: int64(2)
memory usage: 312.6 KB

In [380]:
football.head()

,Date,Season,home,visitor,hgoal,vgoal,division,totgoal,goaldif,result
131077,1986-09-02,1986,Arsenal,Sheffield Wednesday,2,0,1,2,2,H
131078,1986-09-02,1986,Charlton Athletic,Wimbledon,0,1,1,1,-1,A
131079,1986-09-02,1986,Chelsea,Coventry City,0,0,1,0,0,D
131080,1986-09-02,1986,Everton,Oxford United,3,1,1,4,2,H
131081,1986-09-02,1986,Southampton,Tottenham Hotspur,2,0,1,2,2,H

In [381]:
football = football.drop('Date', axis=1)

In [382]:
football = pd.concat([temp, football], axis=1)
football.head()

,month,day,Season,home,visitor,hgoal,vgoal,division,totgoal,goaldif,result
131077,9,9,1986,Arsenal,Sheffield Wednesday,2,0,1,2,2,H
131078,9,9,1986,Charlton Athletic,Wimbledon,0,1,1,1,-1,A
131079,9,9,1986,Chelsea,Coventry City,0,0,1,0,0,D
131080,9,9,1986,Everton,Oxford United,3,1,1,4,2,H
131081,9,9,1986,Southampton,Tottenham Hotspur,2,0,1,2,2,H

In [383]:
football.division = football.division.astype(int)

In [384]:
football.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 13338 entries, 131077 to 198491
Data columns (total 11 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   month     13338 non-null  int64
 1   day       13338 non-null  int64
 2   Season    13338 non-null  int64
 3   home      13338 non-null  object
 4   visitor   13338 non-null  object
 5   hgoal     13338 non-null  int64
 6   vgoal     13338 non-null  int64
 7   division  13338 non-null  int64
 8   totgoal   13338 non-null  int64
 9   goaldif   13338 non-null  int64
 10  result    13338 non-null  object
dtypes: int64(8), object(3)
memory usage: 1.2+ MB

## Paso 3
- Creando diccionario de equipos
- Borrando columna result

In [385]:
football.head()

,month,day,Season,home,visitor,hgoal,vgoal,division,totgoal,goaldif,result
131077,9,9,1986,Arsenal,Sheffield Wednesday,2,0,1,2,2,H
131078,9,9,1986,Charlton Athletic,Wimbledon,0,1,1,1,-1,A
131079,9,9,1986,Chelsea,Coventry City,0,0,1,0,0,D
131080,9,9,1986,Everton,Oxford United,3,1,1,4,2,H
131081,9,9,1986,Southampton,Tottenham Hotspur,2,0,1,2,2,H

In [386]:
teams_set = set(football.home).union(set(football.visitor))
print(len(teams_set))
print(teams_set)

53
{'West Bromwich Albion', 'Chelsea', 'Aston Villa', 'Hull City', 'Tottenham Hotspur', 'Burnley', 'Bradford City', 'Blackburn Rovers', 'Newcastle United', 'Queens Park Rangers', 'Reading', 'Crystal Palace', 'AFC Bournemouth', 'Sheffield United', 'Wolverhampton Wanderers', 'Watford', 'West Ham United', 'Manchester United', 'Derby County', 'Oldham Athletic', 'Millwall', 'Manchester City', 'Charlton Athletic', 'Bolton Wanderers', 'Middlesbrough', 'Portsmouth', 'Cardiff City', 'Sunderland', 'Stoke City', 'Brighton & Hove Albion', 'Oxford United', 'Luton Town', 'Ipswich Town', 'Wigan Athletic', 'Arsenal', 'Leicester City', 'Southampton', 'Huddersfield Town', 'Swindon Town', 'Liverpool', 'Norwich City', 'Coventry City', 'Sheffield Wednesday', 'Birmingham City', 'Fulham', 'Notts County', 'Leeds United', 'Nottingham Forest', 'Blackpool', 'Swansea City', 'Everton', 'Barnsley', 'Wimbledon'}

In [387]:
teams_dict = dict(zip(teams_set,range(len(teams_set))))
teams_dict

{'West Bromwich Albion': 0,
 'Chelsea': 1,
 'Aston Villa': 2,
 'Hull City': 3,
 'Tottenham Hotspur': 4,
 'Burnley': 5,
 'Bradford City': 6,
 'Blackburn Rovers': 7,
 'Newcastle United': 8,
 'Queens Park Rangers': 9,
 'Reading': 10,
 'Crystal Palace': 11,
 'AFC Bournemouth': 12,
 'Sheffield United': 13,
 'Wolverhampton Wanderers': 14,
 'Watford': 15,
 'West Ham United': 16,
 'Manchester United': 17,
 'Derby County': 18,
 'Oldham Athletic': 19,
 'Millwall': 20,
 'Manchester City': 21,
 'Charlton Athletic': 22,
 'Bolton Wanderers': 23,
 'Middlesbrough': 24,
 'Portsmouth': 25,
 'Cardiff City': 26,
 'Sunderland': 27,
 'Stoke City': 28,
 'Brighton & Hove Albion': 29,
 'Oxford United': 30,
 'Luton Town': 31,
 'Ipswich Town': 32,
 'Wigan Athletic': 33,
 'Arsenal': 34,
 'Leicester City': 35,
 'Southampton': 36,
 'Huddersfield Town': 37,
 'Swindon Town': 38,
 'Liverpool': 39,
 'Norwich City': 40,
 'Coventry City': 41,
 'Sheffield Wednesday': 42,
 'Birmingham City': 43,
 'Fulham': 44,
 'Notts County': 45,
 'Leeds United': 46,
 'Nottingham Forest': 47,
 'Blackpool': 48,
 'Swansea City': 49,
 'Everton': 50,
 'Barnsley': 51,
 'Wimbledon': 52}

In [388]:
football.home = football.home.apply(teams_dict.get)
football.head()

,month,day,Season,home,visitor,hgoal,vgoal,division,totgoal,goaldif,result
131077,9,9,1986,34,Sheffield Wednesday,2,0,1,2,2,H
131078,9,9,1986,22,Wimbledon,0,1,1,1,-1,A
131079,9,9,1986,1,Coventry City,0,0,1,0,0,D
131080,9,9,1986,50,Oxford United,3,1,1,4,2,H
131081,9,9,1986,36,Tottenham Hotspur,2,0,1,2,2,H

In [389]:
football.visitor = football.visitor.apply(teams_dict.get)
football.head()

,month,day,Season,home,visitor,hgoal,vgoal,division,totgoal,goaldif,result
131077,9,9,1986,34,42,2,0,1,2,2,H
131078,9,9,1986,22,52,0,1,1,1,-1,A
131079,9,9,1986,1,41,0,0,1,0,0,D
131080,9,9,1986,50,30,3,1,1,4,2,H
131081,9,9,1986,36,4,2,0,1,2,2,H

In [390]:
football = football.drop('result', axis=1)
football = football.drop('division', axis=1)
football = football.drop('totgoal', axis=1)
football = football.drop('goaldif', axis=1)

In [391]:
football.rename(columns={'Season':'season'}, inplace=True)

In [392]:
football.head()

        month  day  season  home  visitor  hgoal  vgoal
131077      9    9    1986    34       42      2      0
131078      9    9    1986    22       52      0      1
131079      9    9    1986     1       41      0      0
131080      9    9    1986    50       30      3      1
131081      9    9    1986    36        4      2      0

In [393]:
football.tail()

        month  day  season  home  visitor  hgoal  vgoal
198487      7    7    2019    35       17      0      2
198488      7    7    2019    21       40      5      0
198489      7    7    2019     8       39      1      3
198490      7    7    2019    36       13      3      1
198491      7    7    2019    16        2      1      1

In [394]:
football.season.unique()

array([1986, 1987, 1988, 1989, 1990, 1991, 1992, 1993, 1994, 1995, 1996,
       1997, 1998, 1999, 2000, 2001, 2002, 2003, 2004, 2005, 2006, 2007,
       2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018,
       2019])